## Pandas 학습

### 라이브러리 추가

'''python
!pip install pandas
'''

- Successfully installed... : 최초설치
- Requirement already satisfied...: 이미 설치됨

In [12]:
!pip install pandas

Requirement already satisfied: pandas in c:\dev\python312\lib\site-packages (2.2.1)
Requirement already satisfied: numpy<2,>=1.26.0 in c:\dev\python312\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\dev\python312\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\dev\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\dev\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\dev\python312\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

### 판다스 라이브러리 로딩
'''python
import pandas
'''

In [13]:
import pandas as pd

### Pandas 기본
#### DataFrame 객체
- 파이썬 2차원 리스트(배열)와 동일
- 행(row) 각 하나의 유니크 데이터 묶음
- 열(column) 유니크한 데이터의 하나하나의 특성

In [14]:
## 딕셔너리로 DataFrame 객체 생성 / 2차원 리스트와 동일하게 생성 가능
data = {'이름': ['이빵빵', '김옥지', '끼꼬'], '나이':[28, 28, 10], '지역':['서울','서울','서울']}
df = pd.DataFrame(data=data)
df

    이름  나이  지역
0  이빵빵  28  서울
1  김옥지  28  서울
2   끼꼬  10  서울

In [15]:
## 2차원 리스트 생성
data = [['이빵빵', 28, '서울', 'bbang2@naver.com', False], ['김옥지', 28, '서울', 'okz@gmail.com', False],
        ['끼꼬', 10, '서울', 'kk@naver.com', False], ['신형만', 60, '일본', 'g9@naver.com', True]]

data

[['이빵빵', 28, '서울', 'bbang2@naver.com', False],
 ['김옥지', 28, '서울', 'okz@gmail.com', False],
 ['끼꼬', 10, '서울', 'kk@naver.com', False],
 ['신형만', 60, '일본', 'g9@naver.com', True]]

In [16]:
df = pd.DataFrame(data=data, columns=['이름', '나이', '지역', 'e-mail', '결혼유무'])
df

    이름  나이  지역            e-mail   결혼유무
0  이빵빵  28  서울  bbang2@naver.com  False
1  김옥지  28  서울     okz@gmail.com  False
2   끼꼬  10  서울      kk@naver.com  False
3  신형만  60  일본      g9@naver.com   True

In [20]:
## DataFrame에서 데이터 조회 (열) - 리스트는 for문을 써야 출력가능
df['이름']

0    이빵빵
1    김옥지
2     끼꼬
3    신형만
Name: 이름, dtype: object

In [21]:
## 데이터프레임 조회 (두개 열) 
df[['이름', '나이']]

    이름  나이
0  이빵빵  28
1  김옥지  28
2   끼꼬  10
3  신형만  60

In [22]:
## 데이터프레임 행으로 조회
df.loc[0]

이름                     이빵빵
나이                      28
지역                      서울
e-mail    bbang2@naver.com
결혼유무                 False
Name: 0, dtype: object

In [27]:
## 데이터프레임 조회(행)
df.loc[[0,3]]

    이름  나이  지역            e-mail   결혼유무
0  이빵빵  28  서울  bbang2@naver.com  False
3  신형만  60  일본      g9@naver.com   True

In [30]:
# 현재 데이터 프레임 확인
df

    이름  나이  지역            e-mail   결혼유무 전화번호
0  이빵빵  28  서울  bbang2@naver.com  False  010
1  김옥지  28  서울     okz@gmail.com  False  011
2   끼꼬  10  서울      kk@naver.com  False  070
3  신형만  60  일본      g9@naver.com   True  016

In [32]:
## 새 컬럼 추가
df['전화번호'] = ['010', '011', '016', '070']

In [33]:
# 추가된 데이터 프레임 확인
df

    이름  나이  지역            e-mail   결혼유무 전화번호
0  이빵빵  28  서울  bbang2@naver.com  False  010
1  김옥지  28  서울     okz@gmail.com  False  011
2   끼꼬  10  서울      kk@naver.com  False  016
3  신형만  60  일본      g9@naver.com   True  070

In [40]:
## 열 삭제 (결혼유무 열 삭제) axis = 0 : 행 / axis = 1 : 열
df.drop('결혼유무', axis=1)

    이름  나이  지역            e-mail 전화번호
0  이빵빵  28  서울  bbang2@naver.com  010
1  김옥지  28  서울     okz@gmail.com  011
2   끼꼬  10  서울      kk@naver.com  016
3  신형만  60  일본      g9@naver.com  070

In [ ]:
## drop()은 삭제된 모습을 출력해줌, 완전 삭제는 inplace 옵션 사용
# inplace를 화면에 출력안됨
df.drop('결혼유무', axis=1, inplace=True) # 열로 삭제하려면 axis=1만 사용

In [44]:
# 삭제된 것을 확인
df

    이름  나이  지역            e-mail 전화번호
0  이빵빵  28  서울  bbang2@naver.com  010
1  김옥지  28  서울     okz@gmail.com  011
2   끼꼬  10  서울      kk@naver.com  016
3  신형만  60  일본      g9@naver.com  070

In [47]:
## 행 추가
df.loc[4] = ['손흥민', 32, '런던', 'son@naver.com', '010']

In [48]:
df

    이름  나이  지역            e-mail 전화번호
0  이빵빵  28  서울  bbang2@naver.com  010
1  김옥지  28  서울     okz@gmail.com  011
2   끼꼬  10  서울      kk@naver.com  016
3  신형만  60  일본      g9@naver.com  070
4  손흥민  32  런던     son@naver.com  010

In [52]:
## 행 삭제(행 번호) / 완전 삭제 시 inplace 사용 혹은 새로운 변수에 재할당
df.drop(3)
df2 = df.drop(3)
df2

    이름  나이  지역            e-mail 전화번호
0  이빵빵  28  서울  bbang2@naver.com  010
1  김옥지  28  서울     okz@gmail.com  011
2   끼꼬  10  서울      kk@naver.com  016
4  손흥민  32  런던     son@naver.com  010

In [54]:
## 행 삭제 inplace, 행 삭제는 axis=0만 사용 혹은 생략
df.drop(2, axis=0, inplace=True)

In [64]:
df

    이름  나이  지역            e-mail  휴대폰
0  이빵빵  28  서울  bbang2@naver.com  010
1  김옥지  28  서울     okz@gmail.com  011
3  신형만  60  일본      g9@naver.com  070
4  손흥민  32  런던     son@naver.com  010

In [62]:
## 열 이름 변경
df.rename(columns={'전화번호' : '휴대폰'}, inplace=True)

    이름  나이  지역            e-mail  휴대폰
0  이빵빵  28  서울  bbang2@naver.com  010
1  김옥지  28  서울     okz@gmail.com  011
3  신형만  60  일본      g9@naver.com  070
4  손흥민  32  런던     son@naver.com  010

- 데이터 프레임은 파이썬의 2차원 리스트와 동일하지만, 보다 사용하기 쉽게 만들어진 클래스이다.

#### 시리즈 객체

- 파이썬에서 1차원 리스트(배열)
- 시리즈를 그루핑 한 것이 데이터프레임
- 가장 최소단위

In [65]:
data = [28, 28, 60, 32]
srs = pd.Series(data=data)
srs

0    28
1    28
2    60
3    32
dtype: int64

In [66]:
## 데이터프레임의 한 열을 가지고 온 자료구조와 시리즈는 동일하다.
type(df['나이'])

pandas.core.series.Series

In [67]:
type(srs)

pandas.core.series.Series

In [68]:
srs = pd.Series(data=data, index=['이빵빵', '김옥지', '신형만', '손흥민'])
srs

이빵빵    28
김옥지    28
신형만    60
손흥민    32
dtype: int64

In [70]:
## 조회
srs['김옥지']

28

In [72]:
srs['이빵빵'] = 30
srs

이빵빵    30
김옥지    28
신형만    60
손흥민    32
dtype: int64

In [ ]:
## 데이터프레임에서 한 행을 가져와도 시리즈.
df.loc[1]

### 데이터 프레임 사용하기

- CSV, 엑셀파일 로드
- VS Code 플러그인, GrapeCity의 Excel Viewer 설치 필요

In [75]:
df_csv = pd.read_csv('./data/sample_1.csv', encoding='utf-8')
df_csv

  2019년 11월 입국객 수 Unnamed: 1 Unnamed: 2 Unnamed: 3
0            국적코드         성별       입국객수       전년동기
1             A01         남성     106320      85815
2             A01         여성     191436     125241
3             A31         남성        319        299
4             A31         여성         42         54
5             A18         남성     158912     124486
6             A18         여성     232943     163466
7           총 합계      689972        NaN        NaN
8            전년동기     499361        NaN        NaN